witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
	LCDDriver_printText(TRX.LOCATOR, 10, 37, COLOR_GREEN, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	LCDDriver_drawFastHLine(8 + sysmenu_trx_selected_locator_char_index * 12, 54, 12, COLOR_RED);
}

static void SYSMENU_TRX_RotateCallsignChar(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] == 0)
		full_redraw = true;
	TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] += dir;

	// do not show special characters
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 1 && TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] <= 32 && dir > 0)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 33;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 1 && TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] <= 32 && dir < 0)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 0;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 127)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 0;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_TRX_RotateLocatorChar(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] == 0)
		full_redraw = true;
	TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] += dir;

	// do not show special characters
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 1 && TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] <= 32 && dir > 0)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 33;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 1 && TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] <= 32 && dir < 0)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 0;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 127)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 0;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_HANDL_TRX_SetCallsign(int8_t direction)
{
#pragma unused(direction)
	sysmenu_trx_setCallsign_menu_opened = true;
	SYSMENU_TRX_DrawCallsignMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_TRX_SetLocator(int8_t direction)
{
#pragma unused(direction)
	sysmenu_trx_setLocator_menu_opened = true;
	SYSMENU_TRX_DrawLocatorMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_TRX_TRANSV_ENABLE(int8_t direction)
{
	if (direction > 0)
		TRX.Custom_Transverter_Enabled = true;
	if (direction < 0)
		TRX.Custom_Transverter_Enabled = false;
}

static void SYSMENU_HANDL_TRX_TRANSV_OFFSET(int8_t direction)
{
	TRX.Transverter_Offset_Mhz += direction;
	if (TRX.Transverter_Offset_Mhz < 1)
		TRX.Transverter_Offset_Mhz = 1;
	if (TRX.Transverter_Offset_Mhz > 15000)
		TRX.Transverter_Offset_Mhz = 15000;
}

static void SYSMENU_HANDL_TRX_TRANSV_70CM(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_70cm = true;
	if (direction < 0)
		TRX.Transverter_70cm = false;
}

static void SYSMENU_HANDL_TRX_TRANSV_23CM(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_23cm = true;
	if (direction < 0)
		TRX.Transverter_23cm = false;

	BANDS[BANDID_23cm].selectable = TRX.Transverter_23cm;
}

static void SYSMENU_HANDL_TRX_TRANSV_13CM(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_13cm = true;
	if (direction < 0)
		TRX.Transverter_13cm = false;

	BANDS[BANDID_13cm].selectable = TRX.Transverter_13cm;
}

static void SYSMENU_HANDL_TRX_TRANSV_6CM(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_6cm = true;
	if (direction < 0)
		TRX.Transverter_6cm = false;

	BANDS[BANDID_6cm].selectable = TRX.Transverter_6cm;
}

static void SYSMENU_HANDL_TRX_TRANSV_3CM(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_3cm = true;
	if (direction < 0)
		TRX.Transverter_3cm = false;

	BANDS[BANDID_3cm].selectable = TRX.Transverter_3cm;
}

static void SYSMENU_HANDL_TRX_ATU_I(int8_t direction)
{
	if (TRX.ATU_I > 0 || direction > 0)
		TRX.ATU_I += direction;
	if (TRX.ATU_I > ATU_MAXPOS)
		TRX.ATU_I = ATU_MAXPOS;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_I = TRX.ATU_I;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_C = TRX.ATU_C;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_T = TRX.ATU_T;
	}
}

static void SYSMENU_HANDL_TRX_ATU_C(int8_t direction)
{
	if (TRX.ATU_C > 0 || direction > 0)
		TRX.ATU_C += direction;
	if (TRX.ATU_C > ATU_MAXPOS)
		TRX.ATU_C = ATU_MAXPOS;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_I = TRX.ATU_I;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_C = TRX.ATU_C;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_T = TRX.ATU_T;
	}
}

static void SYSMENU_HANDL_TRX_ATU_T(int8_t direction)
{
	if (direction > 0)
		TRX.ATU_T = true;
	if (direction < 0)
		TRX.ATU_T = false;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_I = TRX.ATU_I;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_C = TRX.ATU_C;
		TRX.BANDS_SAVED_SETTINGS[band].BEST_ATU_T = TRX.ATU_T;
	}
}

static void SYSMENU_HANDL_TRX_ATU_Enabled(int8_t direction)
{
	if (direction > 0)
		TRX.ATU_Enabled = true;
	if (direction < 0)
		TRX.ATU_Enabled = false;
}

static void SYSMENU_HANDL_TRX_TUNER_Enabled(int8_t direction)
{
	if (direction > 0)
		TRX.TUNER_Enabled = true;
	if (direction < 0)
		TRX.TUNER_Enabled = false;
}

// AUDIO MENU

static void SYSMENU_HANDL_AUDIOMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (const struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_audio_handlers) / sizeof(sysmenu_audio_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

void SYSMENU_AUDIO_BW_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(13);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_CW_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(15);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_AM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(17);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_FM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(19);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_HPF_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(11);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_SQUELCH_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(23);
	LCD_redraw(false);
}

void SYSMENU_AUDIO_DNR_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(8);
	LCD_redraw(false);
}

