witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_SCREEN_FFT_DXCluster_Timeout(int8_t direction)
{
	if (TRX.FFT_DXCluster_Timeout > 0 || direction > 0)
		TRX.FFT_DXCluster_Timeout += direction;
	if (TRX.FFT_DXCluster_Timeout > 30)
		TRX.FFT_DXCluster_Timeout = 30;

	WIFI_DXCLUSTER_list_count = 0;
	TRX_DXCluster_UpdateTime = 0;
}

static void SYSMENU_HANDL_SCREEN_FFT_Background(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Background = true;
	if (direction < 0)
		TRX.FFT_Background = false;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Lens(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Lens = true;
	if (direction < 0)
		TRX.FFT_Lens = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_HoldPeaks(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_HoldPeaks = true;
	if (direction < 0)
		TRX.FFT_HoldPeaks = false;
}

static void SYSMENU_HANDL_SCREEN_LCD_Brightness(int8_t direction)
{
	TRX.LCD_Brightness += direction;
	if (TRX.LCD_Brightness < 1)
		TRX.LCD_Brightness = 1;
	if (TRX.LCD_Brightness > 100)
		TRX.LCD_Brightness = 100;
	LCDDriver_setBrightness(TRX.LCD_Brightness);
}

static void SYSMENU_HANDL_SCREEN_LCD_SleepTimeout(int8_t direction)
{
	if (TRX.LCD_SleepTimeout > 0 || direction > 0)
		TRX.LCD_SleepTimeout += direction;
	if (TRX.LCD_SleepTimeout > 1000)
		TRX.LCD_SleepTimeout = 1000;
}

static void SYSMENU_HANDL_SCREEN_FFT_3D(int8_t direction)
{
	TRX.FFT_3D += direction;
	if (TRX.FFT_3D > 2)
		TRX.FFT_3D = 2;
}

static void SYSMENU_HANDL_SCREEN_FFT_Automatic(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Automatic = true;
	if (direction < 0)
		TRX.FFT_Automatic = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_ManualBottom(int8_t direction)
{
	TRX.FFT_ManualBottom += direction;
	if (TRX.FFT_ManualBottom < -150)
		TRX.FFT_ManualBottom = -150;
	if (TRX.FFT_ManualBottom > 50)
		TRX.FFT_ManualBottom = 50;
}

static void SYSMENU_HANDL_SCREEN_FFT_ManualTop(int8_t direction)
{
	TRX.FFT_ManualTop += direction;
	if (TRX.FFT_ManualTop < -150)
		TRX.FFT_ManualTop = -150;
	if (TRX.FFT_ManualTop > 50)
		TRX.FFT_ManualTop = 50;
}

static void SYSMENU_HANDL_SCREEN_FFT_Speed(int8_t direction)
{
	TRX.FFT_Speed += direction;
	if (TRX.FFT_Speed < 1)
		TRX.FFT_Speed = 1;
	if (TRX.FFT_Speed > 5)
		TRX.FFT_Speed = 5;
}

static void SYSMENU_HANDL_SCREEN_FFT_Sensitivity(int8_t direction)
{
	TRX.FFT_Sensitivity += direction;
	if (TRX.FFT_Sensitivity < FFT_MIN + 1)
		TRX.FFT_Sensitivity = FFT_MIN + 1;
	if (TRX.FFT_Sensitivity > FFT_MAX_TOP_SCALE)
		TRX.FFT_Sensitivity = FFT_MAX_TOP_SCALE;
}

static void SYSMENU_HANDL_SCREEN_Show_Sec_VFO(int8_t direction)
{
	if (direction > 0)
		TRX.Show_Sec_VFO = true;
	if (direction < 0)
		TRX.Show_Sec_VFO = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_Scale_Type(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Scale_Type = 1;
	if (direction < 0)
		TRX.FFT_Scale_Type = 0;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON1(int8_t direction)
{
	if (TRX.FuncButtons[0] > 0 || direction > 0)
		TRX.FuncButtons[0] += direction;
	if (TRX.FuncButtons[0] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[0] = FUNCBUTTONS_COUNT - 1;
}

#if FUNCBUTTONS_COUNT > 1
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON2(int8_t direction)
{
	if (TRX.FuncButtons[1] > 0 || direction > 0)
		TRX.FuncButtons[1] += direction;
	if (TRX.FuncButtons[1] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[1] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON3(int8_t direction)
{
	if (TRX.FuncButtons[2] > 0 || direction > 0)
		TRX.FuncButtons[2] += direction;
	if (TRX.FuncButtons[2] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[2] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON4(int8_t direction)
{
	if (TRX.FuncButtons[3] > 0 || direction > 0)
		TRX.FuncButtons[3] += direction;
	if (TRX.FuncButtons[3] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[3] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON5(int8_t direction)
{
	if (TRX.FuncButtons[4] > 0 || direction > 0)
		TRX.FuncButtons[4] += direction;
	if (TRX.FuncButtons[4] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[4] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON6(int8_t direction)
{
	if (TRX.FuncButtons[5] > 0 || direction > 0)
		TRX.FuncButtons[5] += direction;
	if (TRX.FuncButtons[5] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[5] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON7(int8_t direction)
{
	if (TRX.FuncButtons[6] > 0 || direction > 0)
		TRX.FuncButtons[6] += direction;
	if (TRX.FuncButtons[6] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[6] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON8(int8_t direction)
{
	if (TRX.FuncButtons[7] > 0 || direction > 0)
		TRX.FuncButtons[7] += direction;
	if (TRX.FuncButtons[7] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[7] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON9(int8_t direction)
{
	if (TRX.FuncButtons[8] > 0 || direction > 0)
		TRX.FuncButtons[8] += direction;
	if (TRX.FuncButtons[8] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[8] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON10(int8_t direction)
{
	if (TRX.FuncButtons[9] > 0 || direction > 0)
		TRX.FuncButtons[9] += direction;
	if (TRX.FuncButtons[9] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[9] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON11(int8_t direction)
{
	if (TRX.FuncButtons[10] > 0 || direction > 0)
		TRX.FuncButtons[10] += direction;
	if (TRX.FuncButtons[10] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[10] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON12(int8_t direction)
{
	if (TRX.FuncButtons[11] > 0 || direction > 0)
		TRX.FuncButtons[11] += direction;
	if (TRX.FuncButtons[11] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[11] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON13(int8_t direction)
{
	if (TRX.FuncButtons[12] > 0 || direction > 0)
		TRX.FuncButtons[12] += direction;
	if (TRX.FuncButtons[12] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[12] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON14(int8_t direction)
{
	if (TRX.FuncButtons[13] > 0 || direction > 0)
		TRX.FuncButtons[13] += direction;
	if (TRX.FuncButtons[13] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[13] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON15(int8_t direction)
{
	if (TRX.FuncButtons[14] > 0 || direction > 0)
		TRX.FuncButtons[14] += direction;
	if (TRX.FuncButtons[14] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[14] = FUNCBUTTONS_COUNT - 1;
}

