witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_CICCOMP_48K_SHIFT(int8_t direction)
{
	if (CALIBRATE.CICFIR_GAINER_48K_val > 0 || direction > 0)
		CALIBRATE.CICFIR_GAINER_48K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_48K_val > 62)
		CALIBRATE.CICFIR_GAINER_48K_val = 62;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_96K_SHIFT(int8_t direction)
{
	if (CALIBRATE.CICFIR_GAINER_96K_val > 0 || direction > 0)
		CALIBRATE.CICFIR_GAINER_96K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_96K_val > 62)
		CALIBRATE.CICFIR_GAINER_96K_val = 62;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_192K_SHIFT(int8_t direction)
{
	if (CALIBRATE.CICFIR_GAINER_192K_val > 0 || direction > 0)
		CALIBRATE.CICFIR_GAINER_192K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_192K_val > 62)
		CALIBRATE.CICFIR_GAINER_192K_val = 62;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_384K_SHIFT(int8_t direction)
{
	if (CALIBRATE.CICFIR_GAINER_384K_val > 0 || direction > 0)
		CALIBRATE.CICFIR_GAINER_384K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_384K_val > 62)
		CALIBRATE.CICFIR_GAINER_384K_val = 62;
}

static void SYSMENU_HANDL_CALIB_TXCICCOMP_SHIFT(int8_t direction)
{
	if (CALIBRATE.TXCICFIR_GAINER_val > 0 || direction > 0)
		CALIBRATE.TXCICFIR_GAINER_val += direction;
	if (CALIBRATE.TXCICFIR_GAINER_val > 48)
		CALIBRATE.TXCICFIR_GAINER_val = 48;
}

static void SYSMENU_HANDL_CALIB_DAC_SHIFT(int8_t direction)
{
	if (CALIBRATE.DAC_GAINER_val > 0 || direction > 0)
		CALIBRATE.DAC_GAINER_val += direction;
	if (CALIBRATE.DAC_GAINER_val > 27)
		CALIBRATE.DAC_GAINER_val = 27;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2200M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2200m > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m > 300)
		CALIBRATE.rf_out_power_2200m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_160M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_160m > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m == 0 && direction > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m > 300)
		CALIBRATE.rf_out_power_160m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_80M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_80m > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m == 0 && direction > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m > 300)
		CALIBRATE.rf_out_power_80m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_40M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_40m > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m == 0 && direction > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m > 300)
		CALIBRATE.rf_out_power_40m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_30M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_30m > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m == 0 && direction > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m > 300)
		CALIBRATE.rf_out_power_30m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_20M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_20m > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m == 0 && direction > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m > 300)
		CALIBRATE.rf_out_power_20m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_17M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_17m > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m == 0 && direction > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m > 300)
		CALIBRATE.rf_out_power_17m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_15M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_15m > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m == 0 && direction > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m > 300)
		CALIBRATE.rf_out_power_15m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_12M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_12m > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m == 0 && direction > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m > 300)
		CALIBRATE.rf_out_power_12m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_CB(int8_t direction)
{
	if (CALIBRATE.rf_out_power_cb > 0)
		CALIBRATE.rf_out_power_cb += direction;
	if (CALIBRATE.rf_out_power_cb == 0 && direction > 0)
		CALIBRATE.rf_out_power_cb += direction;
	if (CALIBRATE.rf_out_power_cb > 300)
		CALIBRATE.rf_out_power_cb = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_10M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_10m > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m == 0 && direction > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m > 300)
		CALIBRATE.rf_out_power_10m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

