witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_SPECTRUM_End(int8_t direction)
{
	TRX.SPEC_End += direction * 100;
	if (TRX.SPEC_End < 100)
		TRX.SPEC_End = 100;
}

static void SYSMENU_HANDL_SPECTRUM_TopDBM(int8_t direction)
{
	TRX.SPEC_TopDBM += direction;
	if (TRX.SPEC_TopDBM < -140)
		TRX.SPEC_TopDBM = -140;
	if (TRX.SPEC_TopDBM > 40)
		TRX.SPEC_TopDBM = 40;
	if (TRX.SPEC_TopDBM <= TRX.SPEC_BottomDBM)
		TRX.SPEC_TopDBM = TRX.SPEC_BottomDBM + 1;
}

static void SYSMENU_HANDL_SPECTRUM_BottomDBM(int8_t direction)
{
	TRX.SPEC_BottomDBM += direction;
	if (TRX.SPEC_BottomDBM < -140)
		TRX.SPEC_BottomDBM = -140;
	if (TRX.SPEC_BottomDBM > 40)
		TRX.SPEC_BottomDBM = 40;
	if (TRX.SPEC_BottomDBM >= TRX.SPEC_TopDBM)
		TRX.SPEC_BottomDBM = TRX.SPEC_TopDBM - 1;
}

// WSPR Beacon
static void SYSMENU_HANDL_WSPRMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (const struct sysmenu_item_handler *)&sysmenu_wspr_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_wspr_handlers) / sizeof(sysmenu_wspr_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WSPR_Start(int8_t direction)
{
	if (SYSMENU_wspr_opened)
	{
		WSPR_EncRotate(direction);
	}
	else
	{
		SYSMENU_wspr_opened = true;
		WSPR_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_WSPR_FREQ_OFFSET(int8_t direction)
{
	TRX.WSPR_FREQ_OFFSET += direction;
	if (TRX.WSPR_FREQ_OFFSET < -2000)
		TRX.WSPR_FREQ_OFFSET = -2000;
	if (TRX.WSPR_FREQ_OFFSET > 2000)
		TRX.WSPR_FREQ_OFFSET = 2000;
}

static void SYSMENU_HANDL_WSPR_BAND160(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_160 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_160 = false;
}

static void SYSMENU_HANDL_WSPR_BAND80(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_80 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_80 = false;
}

static void SYSMENU_HANDL_WSPR_BAND40(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_40 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_40 = false;
}

static void SYSMENU_HANDL_WSPR_BAND30(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_30 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_30 = false;
}

static void SYSMENU_HANDL_WSPR_BAND20(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_20 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_20 = false;
}

static void SYSMENU_HANDL_WSPR_BAND17(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_17 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_17 = false;
}

static void SYSMENU_HANDL_WSPR_BAND15(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_15 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_15 = false;
}

static void SYSMENU_HANDL_WSPR_BAND12(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_12 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_12 = false;
}

static void SYSMENU_HANDL_WSPR_BAND10(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_10 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_10 = false;
}

static void SYSMENU_HANDL_WSPR_BAND6(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_6 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_6 = false;
}

static void SYSMENU_HANDL_WSPR_BAND2(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_2 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_2 = false;
}

// RDA STATS
static void SYSMENU_HANDL_RDA_STATS(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getRDA();
}

// DX_CLUSTER
static void SYSMENU_HANDL_DX_CLUSTER(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getDXCluster();
}

// PROPAGINATION
static void SYSMENU_HANDL_PROPAGINATION(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getPropagination();
}

// SD FILE MANAGER
static void SYSMENU_HANDL_FILEMANAGER(int8_t direction)
{
	sysmenu_filemanager_opened = true;
	SYSMENU_drawSystemMenu(true);
}

// RECORD CQ MESSAGE
static void SYSMENU_HANDL_RECORD_CQ_WAV(int8_t direction)
{
	sysmenu_filemanager_opened = true;
	FILEMANAGER_StartRecCQWav();
}

// LOCATOR INFO
static void SYSMENU_HANDL_LOCATOR_INFO(int8_t direction)
{
	SYSMENU_locator_info_opened = true;
	LOCINFO_Start();
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

// CALLSIGN INFO
static void SYSMENU_HANDL_CALLSIGN_INFO(int8_t direction)
{
	SYSMENU_callsign_info_opened = true;
	CALLSIGN_INFO_Start();
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

// SELF TEST
static void SYSMENU_HANDL_SELF_TEST(int8_t direction)
{
	SYSMENU_selftest_opened = true;
	SELF_TEST_Start();
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

// COMMON MENU FUNCTIONS
void SYSMENU_drawSystemMenu(bool draw_background)
{
	if (LCD_busy)
	{
		if (draw_background)
			LCD_UpdateQuery.SystemMenuRedraw = true;
		else
			LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	if (!LCD_systemMenuOpened)
		return;
	if (sysmenu_timeMenuOpened)
	{
		SYSMENU_HANDL_SETTIME(0);
		return;
	}
	else if (sysmenu_wifi_selectap1_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP1Menu(draw_background);
	}
	else if (sysmenu_wifi_selectap2_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP2Menu(draw_background);
	}
	else if (sysmenu_wifi_selectap3_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP3Menu(draw_background);
	}
	else if (sysmenu_wifi_setAP1password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP1passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP2password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP2passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP3password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP3passwordMenu(draw_background);
	}
	else if (sysmenu_trx_setCallsign_menu_opened)
	{
		SYSMENU_TRX_DrawCallsignMenu(draw_background);
	}
	else if (sysmenu_trx_setLocator_menu_opened)
	{
		SYSMENU_TRX_DrawLocatorMenu(draw_background);
	}
	else if (SYSMENU_spectrum_opened)
	{
		SPEC_Draw();
	}
	else if (SYSMENU_wspr_opened)
	{
		WSPR_DoEvents();
		return;
	}
#if FT8_SUPPORT
	else if (SYSMENU_FT8_DECODER_opened)
	{
		MenagerFT8();
		return;
	}
#endif
	else if (SYSMENU_TDM_CTRL_opened)
	{
		TDM_Voltages();
	}
	else if (SYSMENU_swr_opened)
	{
		SWR_Draw();
	}
	else if (SYSMENU_locator_info_opened)
	{
		LOCINFO_Draw();
	}
	else if (SYSMENU_callsign_info_opened)
	{
		CALLSIGN_INFO_Draw();
	}
	else if (SYSMENU_selftest_opened)
	{
		SELF_TEST_Draw();
		return;
	}
	else if (sysmenu_sysinfo_opened)
	{
		SYSMENU_HANDL_SYSINFO(0);
		return;
	}
	else if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_Draw(draw_background);
		return;
	}
	else if (sysmenu_ota_opened)
	{
		FILEMANAGER_OTAUpdate_handler();
		return;
	}
	else if (sysmenu_infowindow_opened)
	{
	}
	else
	{
		LCD_busy = true;

		sysmenu_i = 0;
		sysmenu_y = 5;

		if (draw_background)
			LCDDriver_Fill(BG_COLOR);

		uint8_t current_selected_page = SYSTMENU_getPageFromRealIndex(getCurrentMenuIndex());
		if (current_selected_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE > sysmenu_item_count)
			current_selected_page = 0;

		uint8_t visible = 0;
		uint8_t current_page = 0;
		for (uint8_t m = 0; m < sysmenu_item_count; m++)
		{
			if (sysmenu_handlers_selected[m].checkVisibleHandler == NULL || sysmenu_handlers_selected[m].checkVisibleHandler())
			{
				if (current_selected_page == current_page)
					drawSystemMenuElement(&sysmenu_handlers_selected[m], false);

				visible++;
				if (visible >= LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
				{
					visible = 0;
					current_page++;
				}
			}
		}

		LCD_busy = false;
	}

	LCD_UpdateQuery.SystemMenu = false;
	if (draw_background)
		LCD_UpdateQuery.SystemMenuRedraw = false;
}

