witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_eventRotateSystemMenu(int8_t direction)
{
	if (direction < -1)
		direction = -1;
	if (direction > 1)
		direction = 1;

	if (sysmenu_wifi_selectap1_menu_opened)
	{
		SYSMENU_WIFI_SelectAP1MenuMove(0);
		return;
	}
	if (sysmenu_wifi_selectap2_menu_opened)
	{
		SYSMENU_WIFI_SelectAP2MenuMove(0);
		return;
	}
	if (sysmenu_wifi_selectap3_menu_opened)
	{
		SYSMENU_WIFI_SelectAP3MenuMove(0);
		return;
	}
	if (sysmenu_wifi_setAP1password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar1(direction);
		return;
	}
	if (sysmenu_wifi_setAP2password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar2(direction);
		return;
	}
	if (sysmenu_wifi_setAP3password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar3(direction);
		return;
	}
	if (sysmenu_trx_setCallsign_menu_opened)
	{
		SYSMENU_TRX_RotateCallsignChar(direction);
		return;
	}
	if (sysmenu_trx_setLocator_menu_opened)
	{
		SYSMENU_TRX_RotateLocatorChar(direction);
		return;
	}
	if (sysmenu_timeMenuOpened)
	{
		SYSMENU_HANDL_SETTIME(direction);
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_EventRotate(direction);
		return;
	}
	if (sysmenu_handlers_selected[getCurrentMenuIndex()].type != SYSMENU_INFOLINE)
		sysmenu_handlers_selected[getCurrentMenuIndex()].menuHandler(direction);
	if (sysmenu_handlers_selected[getCurrentMenuIndex()].type != SYSMENU_RUN)
		LCD_UpdateQuery.SystemMenuCurrent = true;
}

void SYSMENU_eventCloseSystemMenu(void)
{
	if (sysmenu_wifi_selectap1_menu_opened)
	{
		sysmenu_wifi_selectap1_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	if (sysmenu_wifi_selectap2_menu_opened)
	{
		sysmenu_wifi_selectap2_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	if (sysmenu_wifi_selectap3_menu_opened)
	{
		sysmenu_wifi_selectap3_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP1password_menu_opened)
	{
		sysmenu_wifi_setAP1password_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP2password_menu_opened)
	{
		sysmenu_wifi_setAP2password_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP3password_menu_opened)
	{
		sysmenu_wifi_setAP3password_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_trx_setCallsign_menu_opened)
	{
		sysmenu_trx_setCallsign_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_trx_setLocator_menu_opened)
	{
		sysmenu_trx_setLocator_menu_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_spectrum_opened)
	{
		SYSMENU_spectrum_opened = false;
		SPEC_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_wspr_opened)
	{
		SYSMENU_wspr_opened = false;
		WSPR_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_timeMenuOpened)
	{
		sysmenu_timeMenuOpened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_swr_opened)
	{
		SYSMENU_swr_opened = false;
		SWR_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_locator_info_opened)
	{
		SYSMENU_locator_info_opened = false;
		LOCINFO_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_callsign_info_opened)
	{
		SYSMENU_callsign_info_opened = false;
		CALLSIGN_INFO_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_selftest_opened)
	{
		SYSMENU_selftest_opened = false;
		SELF_TEST_Stop();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
#if FT8_SUPPORT
	else if (SYSMENU_FT8_DECODER_opened)
	{
		FT8_DecodeActiveFlg = false;
		SYSMENU_FT8_DECODER_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
#endif
	else if (SYSMENU_TDM_CTRL_opened)
	{
		SYSMENU_TDM_CTRL_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_infowindow_opened)
	{
		sysmenu_infowindow_opened = false;
		sysmenu_sysinfo_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_Closing();
		sysmenu_filemanager_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_services_opened)
	{
		sysmenu_handlers_selected = (const struct sysmenu_item_handler *)&sysmenu_handlers[0];
		sysmenu_item_count = sizeof(sysmenu_handlers) / sizeof(sysmenu_handlers[0]);
		sysmenu_onroot = true;
		sysmenu_services_opened = false;
		LCD_systemMenuOpened = false;
		LCD_UpdateQuery.Background = true;
		LCD_redraw(false);
	}
	else if (sysmenu_ota_opened)
	{
		sysmenu_ota_opened = false;
		LCD_showInfo("OTA cancelled", true);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else
	{
		if (sysmenu_onroot)
		{
			LCD_systemMenuOpened = false;
			LCD_UpdateQuery.Background = true;
			LCD_redraw(false);
		}
		else
		{
			if (sysmenu_handlers_selected == (const struct sysmenu_item_handler *)&sysmenu_calibration_handlers[0]) // exit from calibration
				NeedSaveCalibration = true;

			sysmenu_handlers_selected = (const struct sysmenu_item_handler *)&sysmenu_handlers[0];
			sysmenu_item_count = sizeof(sysmenu_handlers) / sizeof(sysmenu_handlers[0]);
			sysmenu_onroot = true;
			SYSMENU_drawSystemMenu(true);
		}
	}
	sysmenu_item_selected_by_enc2 = false;
	NeedSaveSettings = true;

	if (SD_USBCardReader)
	{
		SD_USBCardReader = false;
		USBD_Restart();
		TRX_Mute = false;
	}
}

void SYSMENU_eventCloseAllSystemMenu(void)
{
	if (sysmenu_ota_opened)
	{
		sysmenu_ota_opened = false;
		LCD_showInfo("OTA cancelled", true);
	}
	sysmenu_handlers_selected = (const struct sysmenu_item_handler *)&sysmenu_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_handlers) / sizeof(sysmenu_handlers[0]);
	sysmenu_onroot = true;
	sysmenu_item_selected_by_enc2 = false;
	LCD_systemMenuOpened = false;
	LCD_UpdateQuery.Background = true;

#if FT8_SUPPORT
	if (SYSMENU_FT8_DECODER_opened) // Tisho
	{
		FT8_DecodeActiveFlg = false;
		SYSMENU_FT8_DECODER_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
#endif

	LCD_redraw(false);
}

// secondary encoder click
void SYSMENU_eventSecEncoderClickSystemMenu(void)
{
	#if FT8_SUPPORT
	if (SYSMENU_FT8_DECODER_opened)
	{
		FT8_Enc2Click();
		return;
	}
	#endif
	
