witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_redrawCurrentItem(void)
{
	sysmenu_i = SYSTMENU_getVisibleIdFromReal(getCurrentMenuIndex());
	sysmenu_y = 5 + SYSTMENU_getVisibleIdFromReal(getCurrentMenuIndex()) * LAYOUT->SYSMENU_ITEM_HEIGHT;
	drawSystemMenuElement(&sysmenu_handlers_selected[getCurrentMenuIndex()], true);
}

static void drawSystemMenuElement(const struct sysmenu_item_handler *menuElement, bool onlyVal)
{
	if (menuElement->checkVisibleHandler != NULL && !menuElement->checkVisibleHandler())
		return;
	char ctmp[32] = {0};
	float32_t *atu_i = ATU_I_VALS;
	float32_t *atu_c = ATU_C_VALS;
	float32_t float_tmp_val = 0;

	if (!onlyVal)
	{
		LCDDriver_Fill_RectXY(0, sysmenu_y, LAYOUT->SYSMENU_W, sysmenu_y + 17, BG_COLOR);
		LCDDriver_printText(menuElement->title, LAYOUT->SYSMENU_X1, sysmenu_y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	}

	uint16_t x_pos = LAYOUT->SYSMENU_X2 - RASTR_FONT_W * LAYOUT->SYSMENU_FONT_SIZE * ENUM_MAX_LENGTH;
	float32_t tmp_float = 0;
	switch (menuElement->type)
	{
	case SYSMENU_UINT8:
		sprintf(ctmp, "%d", (uint8_t)*menuElement->value);
		break;
	case SYSMENU_B4:
		sprintf(ctmp, "%d%d%d%d", bitRead((uint8_t)*menuElement->value, 3), bitRead((uint8_t)*menuElement->value, 2), bitRead((uint8_t)*menuElement->value, 1), bitRead((uint8_t)*menuElement->value, 0));
		break;
	case SYSMENU_ENUM:
	case SYSMENU_ENUMR:
		sprintf(ctmp, "%s", menuElement->enumerate[(uint8_t)*menuElement->value]);
		break;
	case SYSMENU_UINT16:
		sprintf(ctmp, "%d", (uint16_t)*menuElement->value);
		break;
	case SYSMENU_UINT32:
    case SYSMENU_UINT32R:
		sprintf(ctmp, "%u", (uint32_t)*menuElement->value);
		break;
	case SYSMENU_UINT64:
		sprintf(ctmp, "%llu", (uint64_t)*menuElement->value);
		break;
	case SYSMENU_INT8:
		sprintf(ctmp, "%d", (int8_t)*menuElement->value);
		break;
	case SYSMENU_INT16:
		sprintf(ctmp, "%d", (int16_t)*menuElement->value);
		break;
	case SYSMENU_INT32:
		sprintf(ctmp, "%d", (int32_t)*menuElement->value);
		break;
	case SYSMENU_FLOAT32:
		dma_memcpy(&tmp_float, menuElement->value, sizeof(float32_t));
		sprintf(ctmp, "%.2f", (double)tmp_float);
		break;
	case SYSMENU_BOOLEAN:
		sprintf(ctmp, "%d", (int8_t)*menuElement->value);
		if ((uint8_t)*menuElement->value == 1)
			sprintf(ctmp, "YES");
		else
			sprintf(ctmp, "NO");
		break;
	case SYSMENU_RUN:
		sprintf(ctmp, "RUN");
		break;
	case SYSMENU_MENU:
		sprintf(ctmp, "->");
		break;
	case SYSMENU_INFOLINE:
		break;
	case SYSMENU_FUNCBUTTON:
#if HRDW_HAS_FUNCBUTTONS
		sprintf(ctmp, "%s", (const char *)PERIPH_FrontPanel_FuncButtonsList[TRX.FuncButtons[(uint8_t)*menuElement->value]].name);
#endif
		break;
	case SYSMENU_ATU_I:
		float_tmp_val = 0;
		for (uint8_t i = 0; i < ATU_MAXPOS; i++)
		{
			if (bitRead((uint8_t)*menuElement->value, i))
				float_tmp_val += atu_i[i + 1];
		}
		sprintf(ctmp, "%.2fuH", (double)float_tmp_val);
		break;
	case SYSMENU_ATU_C:
		float_tmp_val = 0;
		for (uint8_t i = 0; i < ATU_MAXPOS; i++)
		{
			if (bitRead((uint8_t)*menuElement->value, i))
				float_tmp_val += atu_c[i + 1];
		}
		sprintf(ctmp, "%dpF", (uint32_t)float_tmp_val);
		break;
	}

	if (menuElement->type != SYSMENU_INFOLINE)
	{
		addSymbols(ctmp, ctmp, ENUM_MAX_LENGTH, " ", false);
		LCDDriver_printText(ctmp, x_pos, sysmenu_y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	}

	if (SYSTMENU_getVisibleIdFromReal(getCurrentMenuIndex()) == sysmenu_i)
	{
		if (sysmenu_item_selected_by_enc2)
			LCDDriver_drawFastHLine(0, sysmenu_y + LAYOUT->SYSMENU_ITEM_HEIGHT - 1, LAYOUT->SYSMENU_W, COLOR->BUTTON_TEXT);
		else
			LCDDriver_drawFastHLine(0, sysmenu_y + LAYOUT->SYSMENU_ITEM_HEIGHT - 1, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	sysmenu_i++;
	sysmenu_y += LAYOUT->SYSMENU_ITEM_HEIGHT;
}

static uint8_t SYSTMENU_getVisibleIdFromReal(uint8_t realIndex)
{
	uint8_t visible = 0;
	for (uint8_t i = 0; i < getCurrentMenuIndex(); i++)
	{
		if (sysmenu_handlers_selected[i].checkVisibleHandler == NULL || sysmenu_handlers_selected[i].checkVisibleHandler())
		{
			visible++;
			if (visible >= LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
			{
				visible = 0;
			}
		}
	}
	return visible;
}

static uint8_t SYSTMENU_getPageFromRealIndex(uint8_t realIndex)
{
	uint8_t visible = 0;
	uint8_t page = 0;
	for (uint8_t i = 0; i < getCurrentMenuIndex(); i++)
	{
		if (sysmenu_handlers_selected[i].checkVisibleHandler == NULL || sysmenu_handlers_selected[i].checkVisibleHandler())
		{
			visible++;
			if (visible >= LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
			{
				visible = 0;
				page++;
			}
		}
	}
	return page;
}

static bool SYSMENU_HANDL_CHECK_HAS_LPF(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return true;
	case RF_UNIT_RU4PN:
		return true;
	case RF_UNIT_WF_100D:
		return true;
	case RF_UNIT_BIG:
		return false;
	case RF_UNIT_SPLIT:
		return false;
	}

	return false;
}

static bool SYSMENU_HANDL_CHECK_HAS_HPF(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return true;
	case RF_UNIT_RU4PN:
		return true;
	case RF_UNIT_WF_100D:
		return true;
	case RF_UNIT_BIG:
		return false;
	case RF_UNIT_SPLIT:
		return false;
	}

	return false;
}

static bool SYSMENU_HANDL_CHECK_HAS_BPF_8(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return false;
	case RF_UNIT_RU4PN:
		return false;
	case RF_UNIT_WF_100D:
		return true;
	case RF_UNIT_BIG:
		return true;
	case RF_UNIT_SPLIT:
		return true;
	}

	return false;
}

static bool SYSMENU_HANDL_CHECK_HAS_BPF_9(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return false;
	case RF_UNIT_RU4PN:
		return false;
	case RF_UNIT_WF_100D:
		return false;
	case RF_UNIT_BIG:
		return true;
	case RF_UNIT_SPLIT:
		return true;
	}

	return false;
}

bool SYSMENU_HANDL_CHECK_HAS_ATU(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return false;
	case RF_UNIT_RU4PN:
		return true;
	case RF_UNIT_WF_100D:
		return true;
	case RF_UNIT_BIG:
		return true;
	case RF_UNIT_SPLIT:
		return true;
	}

	return false;
}

static bool SYSMENU_HANDL_CHECK_HAS_RFFILTERS_BYPASS(void)
{
	switch (CALIBRATE.RF_unit_type)
	{
	case RF_UNIT_QRP:
		return true;
	case RF_UNIT_RU4PN:
		return true;
	case RF_UNIT_WF_100D:
		return true;
	case RF_UNIT_BIG:
		return false;
	case RF_UNIT_SPLIT:
		return false;
	}

	return false;
}

static bool SYSMENU_HANDL_CHECK_HIDDEN_ENABLED(void)
{
	return SYSMENU_hiddenmenu_enabled;
}

static void setCurrentMenuIndex(uint8_t index)
{
	uint8_t count = sizeof(sysmenu_wrappers) / sizeof(sysmenu_wrappers[0]);
	for (uint8_t i = 0; i < count; i++)
		if (sysmenu_wrappers[i].menu_handler == sysmenu_handlers_selected)
			sysmenu_wrappers[i].currentIndex = index;
}

static uint8_t getCurrentMenuIndex(void)
{
	uint8_t count = sizeof(sysmenu_wrappers) / sizeof(sysmenu_wrappers[0]);
	for (uint8_t i = 0; i < count; i++)
		if (sysmenu_wrappers[i].menu_handler == sysmenu_handlers_selected)
			return sysmenu_wrappers[i].currentIndex;

	return 0;
}
